basic/controllers/TransaksiController.php

DELETE FROM `transaksi` WHERE `Kode_transaksi`='PPMD202409130044'
---
    public function actionDelete($Kode_transaksi)
    {
        $this->findModel($Kode_transaksi)->delete();

SELECT * FROM `transaksi` WHERE `Kode_transaksi`='PPMD202409130044'
---
    protected function findModel($Kode_transaksi)
    {
        if (($model = transaksi::findOne(['Kode_transaksi' => $Kode_transaksi])) !== null) {